/********************************************************************
 *                      К  У  Р  С  Ы     С  +  +                   *
 *------------------------------------------------------------------*
 * Project Type  : Win32 Application                                *
 * Project Name  : \Курсы_С++\Lesson_05_Принципы_ООП\Ex05_03_Circ   *
 * File Name     : Point05_04.h                                     *
 * Programmer(s) : Чечиков Ю.Б.  &   Безродных И.П.                 *
 * Modifyed By   :                                                  *
 * Created       : 06/05/04                                         *
 * Last Revision : 21/10/04                                         *
 * Comment(s)    : ОБЪЯВЛЕНИЕ ТРЕХ КЛАССОВ								  *
 *                 НАСЛЕДОВАНИЕ												  *
 *                                                                  *
 ********************************************************************/
#include <iostream>
#include <windows.h>          // Подключим функции Windows
#include "CardWithoutSuit.h"
 /*------------------------------------------------------------------*/
 /*                         Т И П Ы    Д А Н Н Ы Х                   */
 /*------------------------------------------------------------------*/
 /********************************************************************/

class Card : public CardWithoutSuit
{
public:
	Card(int left, int top, int right, int bottom, int width, int height);
	~Card();
	void Show();


	
};

/*********************   End of File Card.h   ****************/

